// Form 전송
// body-parser
// 데이터를 쉽게 처리할 수 있도록 도와준는 라이브러리
// Post로 정보를 전송할 때 요청의 body(req.body)로 받을 수 있게 도와줌
//
// form태그
// 입력된 데이터를 한 번에 서버로 전송하기 위해 사용한다ㅏ.
// 즉, 클라이어ㄴ트가 서버에게 정보를 전달할 때 사용
// input, select, textarea, button 등등이 있다.

// form 받기
// get방식과 post방식의 차이점 내용이 도매인으로 나오는 차이점을 이해하고 확인해보기

//form validation 유효성 검사
//유효성 검사란 form 요소들에 정보가 올바르게 입력되었는지 검사하는것
//필요한 정보가 제대로 들어갔는지 확인하는것
// form에 입력된 결과가 잘못 될 경우 서버가 다운될 수도 있다.
// pattern속성에서 정규식은 외워서 하기는 어렵다.

//nodemon 패키지
//서버측 코드가 변경될 때마다 다시 껐다가 켜주는 패키지
