// 구조분해 할당 - 배열이나 객체의 속성을 해ㅊ해
// 배열 구조 분해와 객체 구조 분배 방법이 있다.

// 배열 구조 분해 : 각 변수에 배열의 인덱스 순으로 값 대응
// const [변수] = 배열; 의 구조
// 보다 직관적으로 보기위해 만들어짐

// 객체 구조 분해
// const {변수} = 객체;
// 객체 안의 속성을 변수명으로 사용
// 변수가 key값이어야 한다.

// ...연산자(spread 연산자)
// 배열을 풀어서 쓴다. 문자열의 경우에도 하나하나 풀어서 써준다.

// rest파라미터
// spread와 모습은 같지만 사용하는 위치가 다르다
// 함수 위치에 사용하게 되면 rest파라미터

// spread와 rest의 차이
// spread는 호출하는 함수의 파라미터에 사용
// rest는 호출받는 함수의 파라미터에 사용.

// 클래스
// 요즘은 함수형으로 많이 바뀌고 있다.
// 생김세는 객체랑 비슷하게 생겼다.
// 클래스는 객체를 생성하기 위한 템플릿.
// constructor는 생성자
// class this는 자기 자신을 의미하는 것이다.(ppt랑 같이 보기)
